Revit 2026 API

# InstanceVoidCutUtils Class

---

Utilities for cutting elements by unattached voids in family instances.

SystemObject Autodesk.Revit.DBInstanceVoidCutUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class InstanceVoidCutUtils
```
```vb
Public NotInheritable Class InstanceVoidCutUtils
```
```cpp
public ref class InstanceVoidCutUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type InstanceVoidCutUtils = class end
```

The InstanceVoidCutUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddInstanceVoidCut | Add a cut to an element using the unattached voids inside a cutting instance. |
|  | CanBeCutWithVoid | Indicates if the element can be cut by an instance with unattached voids. |
|  | GetCuttingVoidInstances | Return ids of the instances with unattached voids cutting the element. |
|  | GetElementsBeingCut | Return ids of the elements being cut by the instance |
|  | InstanceVoidCutExists | Check whether the instance is cutting the element |
|  | IsVoidInstanceCuttingElement | Indicates if the element is a family instance with unattached voids that can cut other elements. |
|  | RemoveInstanceVoidCut | Remove a cut applied to the element by a cutting instance with unattached voids. |

#### Reference

Autodesk.Revit.DB Namespace